10/data/attachments/df837ef60427d4f9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_d6f7e3ce-c392-4fac-b951-4a2e2c4aff44</nif:username>
            <nif:friendToBeAdded>Joshua_money_Actions_62065_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>